In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data/superficie.csv")
iq=pd.read_csv("../data/IQ_pays.csv")

In [3]:
df

                            Pays              Superficie Superficie_edited
0                         Russia  17,098,246 (6,601,667)          17098246
1                     Antarctica  14,200,000 (5,480,000)          14200000
2                         Canada   9,984,670 (3,855,100)           9984670
3                          China   9,596,960 (3,705,410)           9596960
4                  United States   9,369,417 (3,617,551)           9369417
..                           ...                     ...               ...
258  Ashmore and Cartier Islands               5.0 (1.9)               5,0
259            Coral Sea Islands               3.0 (1.2)               3,0
260              Spratly Islands              2.0 (0.77)               2,0
261                       Monaco              2.0 (0.77)               2,0
262                 Vatican City             0.49 (0.19)              0,49

[263 rows x 3 columns]

In [4]:
iq

,country,averageIqByCountry_iqLynnBecker2019,averageIqByCountry_sourceLynnBecker2019,AverageIQ_ICI2017Grade,AverageIQ_ICI2017Score,AverageIQPISA2022MeanScoreMathematics,AverageIQPISA2022MeanScoreReading,AverageIQPISA2022MeanScoreScience
0,India,76.24,T,C-,29.4,406.0,405.0,403.0
1,China,104.10,T,B,47.3,390.0,374.0,384.0
2,United States,97.43,T,A+,74.9,NaN,NaN,NaN
3,Indonesia,78.49,T,D+,23.7,365.0,339.0,365.0
4,Pakistan,80.00,T,D,19.6,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
192,Turks and Caicos Islands,84.29,E,NaN,NaN,NaN,NaN,NaN
193,Marshall Islands,83.96,T,NaN,NaN,NaN,NaN,NaN
194,Liechtenstein,101.07,E,NaN,NaN,NaN,NaN,NaN
195,British Virgin Islands,76.69,E,NaN,NaN,385.0,415.0,411.0
196,Cook Islands,83.96,E,NaN,NaN,430.0,438.0,441.0

In [18]:
res=iq[['country']]

In [19]:
res

                      country
0                       India
1                       China
2               United States
3                   Indonesia
4                    Pakistan
..                        ...
192  Turks and Caicos Islands
193          Marshall Islands
194             Liechtenstein
195    British Virgin Islands
196              Cook Islands

[197 rows x 1 columns]

In [7]:
liste={
    'pays':set(),
    'country':set()
}
out={}
nb=0

In [8]:
out

{}

In [9]:
df[df['Pays']=='US']['Pays']='United States'

In [10]:
df[df['Pays']=='Burkina']['Pays']='Burkina Faso'

In [11]:
df.loc[df['Pays'] == "(North) Sudan", 'Pays'] = "Sudan"

In [12]:
df.loc[df['Pays'] == "(South) Sudan", 'Pays'] = "South Sudan"

In [13]:
df.loc[df['Pays'] == "Equatorial Guinea", 'Pays'] = "Guinea"

In [14]:
df[df['Pays']=='Turkey*']['Pays']='Turkey'

In [15]:
df[df['Pays']=='Georgia*']['Pays']='Georgia'

In [16]:
df.loc[df['Pays'] == "Democratic Republic of the Congo", 'Pays'] = "DR Congo"

In [17]:
df[df["Pays"]=="Dominica"]

         Pays Superficie Superficie_edited
198  Dominica  750 (290)               750

In [29]:
liste=[]
nb=0
for val in res['country']:
    if val in df['Pays'].values:
        liste.append(max(df[df['Pays']==val]['Superficie_edited'].values))
        nb+=1
    else:
        liste.append("None")
print(nb)

190

In [30]:
res['Superficie']=liste

/tmp/ipykernel_62622/983212162.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  res['Superficie']=liste

In [41]:
res[res['Superficie']=='None']

Empty DataFrame
Columns: [country, Superficie]
Index: []

In [40]:
res.loc[res['country']=='Palestine']=6025
res.loc[res['country']=='Georgia']=69700
res.loc[res['country']=='Gambia']=11300
res.loc[res['country']=='Bahamas']=13877
res.loc[res['country']=='Sao Tome and Principe']=1001
res.loc[res['country']=='Micronesia']=701.9
res.loc[res['country']=='Ireland']=70273

In [43]:
res.to_csv('../data/superficie_merged.csv', index=False)